STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Central/STM32_WPAN/App/app_ble.c
/* Host stack buffers */
static uint32_t host_buffer[DIVC(BLE_DYN_ALLOC_SIZE, 4)];
static uint32_t gatt_buffer[DIVC(BLE_GATT_BUF_SIZE, 4)];
static uint64_t host_nvm_buffer[CFG_BLE_NVM_SIZE_MAX];

/* USER CODE BEGIN PV */
extern TMAPAPP_Context_t TMAPAPP_Context;
/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static uint8_t HOST_BLE_Init(void);
static void BleStack_Process_BG(void);
static void Ble_UserEvtRx(void);
static void BLE_ResumeFlowProcessCallback(void);
static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGenerateBdAddress(void);
static const uint8_t* BleGenerateIRValue(void);
static const uint8_t* BleGenerateERValue(void);
/* USER CODE BEGIN PFP */
static tBleStatus APP_COCConnect(uint16_t ConnHandle);
static char Hex_To_Char(uint8_t Hex);

/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  /* USER CODE BEGIN APP_BLE_Init_1 */

  /* USER CODE END APP_BLE_Init_1 */

  LST_init_head(&BleAsynchEventQueue);

  /* Register BLE Host tasks */
  UTIL_SEQ_RegTask(1U << CFG_TASK_BLE_HOST, UTIL_SEQ_RFU, BleStack_Process_BG);
  UTIL_SEQ_RegTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, Ble_UserEvtRx);

  /* Initialise NVM RAM buffer, invalidate it's content before restauration */
  host_nvm_buffer[0] = 0;

  /* Register A NVM buffer for BLE Host stack */
  SNVMA_Register(APP_BLE_NvmBuffer,
                  (uint32_t *)host_nvm_buffer,
                  (CFG_BLE_NVM_SIZE_MAX * 2));

  /* Realize a restore */
  SNVMA_Restore(APP_BLE_NvmBuffer);
  /* USER CODE BEGIN APP_BLE_Init_Buffers */

  /* USER CODE END APP_BLE_Init_Buffers */

  /* Initialize the BLE Host */
  if (HOST_BLE_Init() == 0u)
  {
    /* Initialization of HCI & GATT & GAP layer */
    Ble_Hci_Gap_Gatt_Init();

    /* Initialization of the BLE Services */
    SVCCTL_Init();

  }
  /* USER CODE BEGIN APP_BLE_Init_2 */

  /* Initialize the Audio Stack*/
  APP_AUDIO_STACK_Init();

  TMAPAPP_Init();

  Menu_Config();

  /* USER CODE END APP_BLE_Init_2 */

  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  tBleStatus ret = BLE_STATUS_ERROR;
  hci_event_pckt    *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;
  UNUSED(ret);
  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  switch (p_event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 *p_disconnection_complete_event;
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;
      UNUSED(p_disconnection_complete_event);

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_1 */
      LOG_INFO_APP(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE\n");
      LOG_INFO_APP("     - Connection Handle:   0x%04X\n     - Reason:    0x%02X\n",
                  p_disconnection_complete_event->Connection_Handle,
                  p_disconnection_complete_event->Reason);
      TMAPAPP_LinkDisconnected(p_disconnection_complete_event->Connection_Handle,
                               p_disconnection_complete_event->Reason);

      /* USER CODE END EVT_DISCONN_COMPLETE_1 */
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */
    }
    case HCI_HARDWARE_ERROR_EVT_CODE:
    {
       hci_hardware_error_event_rp0 *p_hardware_error_event;

       p_hardware_error_event = (hci_hardware_error_event_rp0 *)p_event_pckt->data;
       UNUSED(p_hardware_error_event);
       LOG_INFO_APP(">>== HCI_HARDWARE_ERROR_EVT_CODE\n");
       LOG_INFO_APP("Hardware Code = 0x%02X\n",p_hardware_error_event->Hardware_Code);
       /* USER CODE BEGIN HCI_EVT_LE_HARDWARE_ERROR */

       /* USER CODE END HCI_EVT_LE_HARDWARE_ERROR */
       break; /* HCI_HARDWARE_ERROR_EVT_CODE */
    }
    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_update_complete_event_rp0 *p_conn_update_complete;
          p_conn_update_complete = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          UNUSED(p_conn_update_complete);

          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */
          uint32_t conn_interval_us = 0;
          conn_interval_us = p_conn_update_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                       conn_interval_us / 1000,
                       (conn_interval_us%1000) / 10,
                       p_conn_update_complete->Conn_Latency,
                       p_conn_update_complete->Supervision_Timeout*10);
          UNUSED(conn_interval_us);
          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;
        }
        case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_phy_update_complete_event_rp0 *p_le_phy_update_complete;
          p_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          UNUSED(p_le_phy_update_complete);

          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */
          LOG_INFO_APP(">>== HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE - ACL Connection handle: 0x%04X  - Status 0x%02X\n",
                       p_le_phy_update_complete->Connection_Handle,
                       p_le_phy_update_complete->Status);
          LOG_INFO_APP(">>== RX_PHY : 0x%02X  - TX_PHY : 0x%02X\n",
                       p_le_phy_update_complete->RX_PHY,
                       p_le_phy_update_complete->TX_PHY);
          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
          break;
        }
        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_conn_complete;
          p_enhanced_conn_complete = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          UNUSED(p_enhanced_conn_complete);
          /* USER CODE BEGIN HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          uint32_t conn_interval_us = 0;
          uint8_t type, a_address[6];
          conn_interval_us = p_enhanced_conn_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n",
                       p_enhanced_conn_complete->Connection_Handle);
          LOG_INFO_APP("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_enhanced_conn_complete->Peer_Address[5],
                      p_enhanced_conn_complete->Peer_Address[4],
                      p_enhanced_conn_complete->Peer_Address[3],
                      p_enhanced_conn_complete->Peer_Address[2],
                      p_enhanced_conn_complete->Peer_Address[1],
                      p_enhanced_conn_complete->Peer_Address[0]);
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                      conn_interval_us / 1000,
                      (conn_interval_us%1000) / 10,
                      p_enhanced_conn_complete->Conn_Latency,
                      p_enhanced_conn_complete->Supervision_Timeout * 10
                     );
          UNUSED(conn_interval_us);
          if (aci_gap_check_bonded_device(p_enhanced_conn_complete->Peer_Address_Type,
                                      &p_enhanced_conn_complete->Peer_Address[0],
                                      &type,
                                      a_address ) == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP(">>== device is already bonded\n");
          }
          else
          {
            LOG_INFO_APP(">>== device is not bonded\n");
          }
          if (p_enhanced_conn_complete->Status == 0)
          {
            uint8_t status;
            TMAPAPP_AclConnected(p_enhanced_conn_complete->Connection_Handle,
                                p_enhanced_conn_complete->Peer_Address_Type,
                                p_enhanced_conn_complete->Peer_Address,
                                p_enhanced_conn_complete->Role);

            status = APP_COCConnect(p_enhanced_conn_complete->Connection_Handle);
            if (status != BLE_STATUS_SUCCESS)
            {
              status = aci_gap_send_pairing_req(p_enhanced_conn_complete->Connection_Handle, 0x00);
              if (status != BLE_STATUS_SUCCESS)
              {
                LOG_INFO_APP("==>> aci_gap_send_pairing_req : Fail, reason: 0x%02X\n", status);
              }
              else
              {
                LOG_INFO_APP("==>> aci_gap_send_pairing_req : Success\n");
              }
            }
          }
          Menu_SetConnectingPage(p_enhanced_conn_complete->Connection_Handle);
          /* USER CODE END HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_complete_event_rp0 *p_conn_complete;
          p_conn_complete = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;
          UNUSED(p_conn_complete);
          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
          uint32_t conn_interval_us = 0;
          uint8_t type, a_address[6];
          conn_interval_us = p_conn_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n",
                       p_conn_complete->Connection_Handle);
          LOG_INFO_APP("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_conn_complete->Peer_Address[5],
                      p_conn_complete->Peer_Address[4],
                      p_conn_complete->Peer_Address[3],
                      p_conn_complete->Peer_Address[2],
                      p_conn_complete->Peer_Address[1],
                      p_conn_complete->Peer_Address[0]);
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                      conn_interval_us / 1000,
                      (conn_interval_us%1000) / 10,
                      p_conn_complete->Conn_Latency,
                      p_conn_complete->Supervision_Timeout * 10
                     );
          UNUSED(conn_interval_us);
          if (aci_gap_check_bonded_device(p_conn_complete->Peer_Address_Type,
                                          &p_conn_complete->Peer_Address[0],
                                          &type,
                                          a_address ) == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP(">>== device is already bonded\n");
          }
          else
          {
            LOG_INFO_APP(">>== device is not bonded\n");
          }
          if (p_conn_complete->Status == 0)
          {
            uint8_t status;
            TMAPAPP_AclConnected(p_conn_complete->Connection_Handle,
                                p_conn_complete->Peer_Address_Type,
                                p_conn_complete->Peer_Address,
                                p_conn_complete->Role);

            status = APP_COCConnect(p_conn_complete->Connection_Handle);
            if (status != BLE_STATUS_SUCCESS)
            {
              status = aci_gap_send_pairing_req(p_conn_complete->Connection_Handle, 0x00);
              if (status != BLE_STATUS_SUCCESS)
              {
                LOG_INFO_APP("==>> aci_gap_send_pairing_req : Fail, reason: 0x%02X\n", status);
              }
              else
              {
                LOG_INFO_APP("==>> aci_gap_send_pairing_req : Success\n");
              }
            }
          }
          Menu_SetConnectingPage(p_conn_complete->Connection_Handle);
          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        /* USER CODE BEGIN SUBEVENT */
        case HCI_LE_CIS_ESTABLISHED_SUBEVT_CODE:
        {
            hci_le_cis_established_event_rp0 *p_cis_established_event;
            p_cis_established_event = (hci_le_cis_established_event_rp0 *) p_meta_evt->data;
            LOG_INFO_APP(">>== HCI_LE_CIS_ESTABLISHED_SUBEVT_CODE - CIS Connection handle: 0x%04X  - Status 0x%02X\n",
                         p_cis_established_event->Connection_Handle,
                         p_cis_established_event->Status);
            if (p_cis_established_event->Status == BLE_STATUS_SUCCESS)
            {
              TMAPAPP_CISConnected(p_cis_established_event->Connection_Handle);
              LOG_INFO_APP("CIG_Sync_Delay: %d us, CIS_Sync_Delay: %d us\n",
                         p_cis_established_event->CIG_Sync_Delay[0]  \
                         + (p_cis_established_event->CIG_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIG_Sync_Delay[2]<<16),
                         p_cis_established_event->CIS_Sync_Delay[0]  \
                         + (p_cis_established_event->CIS_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIS_Sync_Delay[2]<<16));
              LOG_INFO_APP("Transport_Latency_C_To_P: %d us, Transport_Latency_P_To_C: %d us\n",
                         p_cis_established_event->Transport_Latency_C_To_P[0]  \
                         + (p_cis_established_event->Transport_Latency_C_To_P[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_C_To_P[2]<<16),
                         p_cis_established_event->Transport_Latency_P_To_C[0]  \
                         + (p_cis_established_event->Transport_Latency_P_To_C[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_P_To_C[2]<<16));
              LOG_INFO_APP("PHY_C_To_P: 0x%02X, PHY_P_To_C: 0x%02X\n",
                         p_cis_established_event->PHY_C_To_P,
                         p_cis_established_event->PHY_P_To_C);
              LOG_INFO_APP("BN_C_To_P: 0x%02X, BN_P_To_C: 0x%02X\n",
                         p_cis_established_event->BN_C_To_P,
                         p_cis_established_event->BN_P_To_C);
              LOG_INFO_APP("FT_C_To_P: 0x%02X, FT_P_To_C: 0x%02X\n",
                         p_cis_established_event->FT_C_To_P,
                         p_cis_established_event->FT_P_To_C);
              LOG_INFO_APP("Max_PDU_C_To_P: 0x%04X, Max_PDU_P_To_C: 0x%04X\n",
                         p_cis_established_event->Max_PDU_C_To_P,
                         p_cis_established_event->Max_PDU_P_To_C);
              LOG_INFO_APP("NSE: 0x%02X, ISO_Interval: 0x%04X\n",
                         p_cis_established_event->NSE,
                         p_cis_established_event->ISO_Interval);
            }
        }
        break;

        case HCI_LE_CIS_ESTABLISHED_V2_SUBEVT_CODE:
        {
            hci_le_cis_established_v2_event_rp0 *p_cis_established_event;
            p_cis_established_event = (hci_le_cis_established_v2_event_rp0 *) p_meta_evt->data;
            LOG_INFO_APP(">>== HCI_LE_CIS_ESTABLISHED_V2_SUBEVT_CODE - CIS Connection handle: 0x%04X  - Status 0x%02X\n",
                         p_cis_established_event->Connection_Handle,
                         p_cis_established_event->Status);
            if (p_cis_established_event->Status == BLE_STATUS_SUCCESS)
            {
              TMAPAPP_CISConnected(p_cis_established_event->Connection_Handle);
              LOG_INFO_APP("CIG_Sync_Delay: %d us, CIS_Sync_Delay: %d us\n",
                         p_cis_established_event->CIG_Sync_Delay[0]  \
                         + (p_cis_established_event->CIG_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIG_Sync_Delay[2]<<16),
                         p_cis_established_event->CIS_Sync_Delay[0]  \
                         + (p_cis_established_event->CIS_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIS_Sync_Delay[2]<<16));
              LOG_INFO_APP("Transport_Latency_C_To_P: %d us, Transport_Latency_P_To_C: %d us\n",
                         p_cis_established_event->Transport_Latency_C_To_P[0]  \
                         + (p_cis_established_event->Transport_Latency_C_To_P[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_C_To_P[2]<<16),
                         p_cis_established_event->Transport_Latency_P_To_C[0]  \
                         + (p_cis_established_event->Transport_Latency_P_To_C[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_P_To_C[2]<<16));
              LOG_INFO_APP("PHY_C_To_P: 0x%02X, PHY_P_To_C: 0x%02X\n",
                         p_cis_established_event->PHY_C_To_P,
                         p_cis_established_event->PHY_P_To_C);
              LOG_INFO_APP("BN_C_To_P: 0x%02X, BN_P_To_C: 0x%02X\n",
                         p_cis_established_event->BN_C_To_P,
                         p_cis_established_event->BN_P_To_C);
              LOG_INFO_APP("FT_C_To_P: 0x%02X, FT_P_To_C: 0x%02X\n",
                         p_cis_established_event->FT_C_To_P,
                         p_cis_established_event->FT_P_To_C);
              LOG_INFO_APP("Max_PDU_C_To_P: 0x%04X, Max_PDU_P_To_C: 0x%04X\n",
                         p_cis_established_event->Max_PDU_C_To_P,
                         p_cis_established_event->Max_PDU_P_To_C);
              LOG_INFO_APP("NSE: 0x%02X, ISO_Interval: 0x%04X\n",
                         p_cis_established_event->NSE,
                         p_cis_established_event->ISO_Interval);
            }
        }
        break;

        case HCI_LE_REMOTE_CONNECTION_PARAMETER_REQUEST_SUBEVT_CODE:
        {
          hci_le_remote_connection_parameter_request_event_rp0 *req_event = (hci_le_remote_connection_parameter_request_event_rp0 *)p_meta_evt->data;
          hci_le_remote_connection_parameter_request_reply(req_event->Connection_Handle,
                                                         req_event->Interval_Min,
                                                         req_event->Interval_Max,
                                                         req_event->Max_Latency,
                                                         req_event->Timeout,
                                                         0,
                                                         0);
          break; /* HCI_LE_REMOTE_CONNECTION_PARAMETER_REQUEST_SUBEVT_CODE */
        }

