STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Central/STM32_WPAN/App/app_ble.c
        case HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          uint8_t i;
          uint8_t audio_device = 0;
          uint8_t* name_ptr = 0;
          uint8_t name_len = 0;


          hci_le_extended_advertising_report_event_rp0 *report = (hci_le_extended_advertising_report_event_rp0*) p_meta_evt->data;

          for (i = 0; i < report->Num_Reports; i++)
          {
            uint16_t parse_index = 0;
            while (parse_index + 3 < report->Data_Length)
            {
              if (report->Data[parse_index + 1] == AD_TYPE_SERVICE_DATA
                  && report->Data[parse_index + 2] == 0x4E
                    && report->Data[parse_index + 3] == 0x18)
              {
                audio_device = 1u;
              }
              if ((report->Data[parse_index + 1] == AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST)\
                 || (report->Data[parse_index + 1] == AD_TYPE_16_BIT_SERV_UUID))
              {
                  for (uint16_t j = 0; j< (report->Data[parse_index] - 1);j++)
                  {
                    if ((report->Data[parse_index + 2 + j ] == 0x4E)
                      && (report->Data[parse_index + 3 + j] == 0x18))
                    {
                      audio_device = 1u;
                    }
                    j+=1;
                  }
              }
              if (report->Data[parse_index + 1] == AD_TYPE_COMPLETE_LOCAL_NAME)
              {
                name_ptr = &report->Data[parse_index + 2];
                name_len = report->Data[parse_index] - 1;
              }
              parse_index += report->Data[parse_index] + 1;
            }
          }

          if (audio_device == 1u)
          {
            char name[30] = "Unknown";
            if (name_ptr != 0)
            {
              UTIL_MEM_cpy_8(&name[0], name_ptr, name_len);
              name[name_len] = '\0';
            }

#if (CFG_TEST_VALIDATION == 1u)
            if (memcmp(&name[0], "TMAP_WBA", 8u) != 0)
              return SVCCTL_UserEvtFlowEnable;
#endif /*(CFG_TEST_VALIDATION == 1u)*/

            LOG_INFO_APP("%s: %02x:%02x:%02x:%02x:%02x:%02x\n",
                         name,
                         report->Address[5],
                         report->Address[4],
                         report->Address[3],
                         report->Address[2],
                         report->Address[1],
                         report->Address[0]);
            Menu_AddUnicastServer(&report->Address[0], report->Address_Type, &name[0]);
          }
        }
        break;

        /* USER CODE END SUBEVENT */
        default:
        {
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
        }
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
    }
    break; /* HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ECODE */
        case ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE\n");
          break;
        }
        case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
        {
          aci_gap_pass_key_req_event_rp0 *p_pass_key;
          p_pass_key = (aci_gap_pass_key_req_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_GAP_PASS_KEY_REQ_VSEVT_CODE\n");

          ret = aci_gap_pass_key_resp(p_pass_key->Connection_Handle, CFG_FIXED_PIN);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> aci_gap_pass_key_resp : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> aci_gap_pass_key_resp : Success\n");
          }
          break;
        }
        case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
        {
          uint8_t confirm_value;
          aci_gap_numeric_comparison_value_event_rp0 *p_numeric_comparison;
          p_numeric_comparison = (aci_gap_numeric_comparison_value_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE\n");
          LOG_INFO_APP("     - numeric_value = %ld\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          LOG_INFO_APP("     - Hex_value = %lx\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);

          /* Set confirm value to 1(YES) */
          confirm_value = 1;

          ret = aci_gap_numeric_comparison_value_confirm_yesno(p_numeric_comparison->Connection_Handle, confirm_value);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> aci_gap_numeric_comparison_value_confirm_yesno : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> aci_gap_numeric_comparison_value_confirm_yesno : Success\n");
          }
          break;
        }
        case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
          aci_gap_pairing_complete_event_rp0 *p_pairing_complete;
          p_pairing_complete = (aci_gap_pairing_complete_event_rp0*)p_blecore_evt->data;

          if (p_pairing_complete->Status != 0)
          {
            LOG_INFO_APP("     - Pairing KO\n     - Status: 0x%02X\n     - Reason: 0x%02X\n",
                         p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            LOG_INFO_APP("     - Pairing Success\n");
          }
          LOG_INFO_APP("\n");

          /*Set PHY preferences for the connection*/
          hci_le_set_phy(p_pairing_complete->Connection_Handle, CFG_PHY_PREF, CFG_PHY_PREF_TX, CFG_PHY_PREF_RX, 0);

          if (p_pairing_complete->Status == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("Pairing Complete with connection handle 0x%04X\n", p_pairing_complete->Connection_Handle);

            Menu_SetLinkupPage(p_pairing_complete->Connection_Handle);
            (void)TMAPAPP_Linkup(p_pairing_complete->Connection_Handle);
          }
          else if (p_pairing_complete->Reason == HCI_PIN_OR_KEY_MISSING_ERR_CODE)
          {
            uint8_t status;
            LOG_INFO_APP("Pairing Failed with connection handle 0x%04X because of Key Mismatch : Force Bonding\n",
                         p_pairing_complete->Connection_Handle);
            TMAPAPP_BondLost(p_pairing_complete->Connection_Handle);
            status = aci_gap_send_pairing_req(p_pairing_complete->Connection_Handle, 1);
            if (status != BLE_STATUS_SUCCESS)
            {
              LOG_INFO_APP("==>> aci_gap_send_pairing_req : Fail, reason: 0x%02X\n", status);
            }
            else
            {
              LOG_INFO_APP("==>> aci_gap_send_pairing_req : Success\n");
            }
          }
          else
          {
            LOG_INFO_APP("Pairing Failed with connection handle 0x%04X\n", p_pairing_complete->Connection_Handle);
            TMAPAPP_Disconnect();
            Menu_SetScanningPage();
          }
          break;
        }
        case ACI_GAP_BOND_LOST_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_GAP_BOND_LOST_EVENT\n");
          break;
        }

        /* USER CODE END ECODE */
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        {
          aci_gap_proc_complete_event_rp0 *p_gap_proc_complete;
          p_gap_proc_complete = (aci_gap_proc_complete_event_rp0*) p_blecore_evt->data;
          UNUSED(p_gap_proc_complete);

          LOG_INFO_APP(">>== ACI_GAP_PROC_COMPLETE_VSEVT_CODE\n");
          /* USER CODE BEGIN EVT_GAP_PROCEDURE_COMPLETE */

          /* USER CODE END EVT_GAP_PROCEDURE_COMPLETE */
          break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
        }
        case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
        {
          /* USER CODE BEGIN RADIO_ACTIVITY_EVENT */

          /* USER CODE END RADIO_ACTIVITY_EVENT */
          break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
        }
        case ACI_HAL_FW_ERROR_VSEVT_CODE:
        {
          aci_hal_fw_error_event_rp0 *p_fw_error_event;

          p_fw_error_event = (aci_hal_fw_error_event_rp0 *)p_blecore_evt->data;
          UNUSED(p_fw_error_event);
          LOG_INFO_APP(">>== ACI_HAL_FW_ERROR_VSEVT_CODE\n");
          LOG_INFO_APP("FW Error Type = 0x%02X\n", p_fw_error_event->FW_Error_Type);
          /* USER CODE BEGIN ACI_HAL_FW_ERROR_VSEVT_CODE */

          /* USER CODE END ACI_HAL_FW_ERROR_VSEVT_CODE */
          break;
        }
        /* USER CODE BEGIN ECODE_1 */
        case ACI_GATT_INDICATION_VSEVT_CODE:
        {
          aci_gatt_indication_event_rp0 *p_indication;
          tBleStatus ret;
          p_indication = (aci_gatt_indication_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_GATT_INDICATION_VSEVT_CODE\n");
          LOG_INFO_APP(">>== Connection_Handle : 0x%04X\n", p_indication->Connection_Handle);
          LOG_INFO_APP(">>== Attribute_Handle : 0x%04X\n", p_indication->Attribute_Handle);
          LOG_INFO_APP(">>== Attribute_Value_Length : 0x%02X\n", p_indication->Attribute_Value_Length);
          LOG_INFO_APP(">>== ACI_GATT_INDICATION_VSEVT_CODE\n");
          ret = aci_gatt_confirm_indication(p_indication->Connection_Handle);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : aci_gatt_confirm_indication command, result: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("  Success: aci_gatt_confirm_indication command\n");
          }
          if (ret != BLE_STATUS_SUCCESS)
          {
            /* Impossible to confirm indication due to GATT process ongoing. Notify tmap_app */
            TMAPAPP_ConfirmIndicationRequired(p_indication->Connection_Handle);
          }
          break;
        }
        case ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE:
        {
          aci_l2cap_connection_update_req_event_rp0 *p_conn_update;
          p_conn_update = (aci_l2cap_connection_update_req_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE\n");
          LOG_INFO_APP(">>== Connection_Handle : 0x%04X\n", p_conn_update->Connection_Handle);
          LOG_INFO_APP(">>== Interval_Min : 0x%04X\n", p_conn_update->Interval_Min);
          LOG_INFO_APP(">>== Interval_Max : 0x%04X\n", p_conn_update->Interval_Max);
          LOG_INFO_APP(">>== Latency : 0x%04X\n", p_conn_update->Latency);
          LOG_INFO_APP(">>== Timeout_Multiplier : 0x%04X\n", p_conn_update->Timeout_Multiplier);
          LOG_INFO_APP(">>== Identifier : 0x%02X\n", p_conn_update->Identifier);
          aci_l2cap_connection_parameter_update_resp(p_conn_update->Connection_Handle,
                                                     p_conn_update->Interval_Min,
                                                     p_conn_update->Interval_Max,
                                                     p_conn_update->Latency,
                                                     p_conn_update->Timeout_Multiplier,
                                                     0x00,
                                                     0x00,
                                                     p_conn_update->Identifier,
                                                     0x00);
          break;
        }
#if ((CFG_BLE_OPTIONS & BLE_OPTIONS_ENHANCED_ATT) == BLE_OPTIONS_ENHANCED_ATT)
        case ACI_L2CAP_COC_CONNECT_VSEVT_CODE:
        {
          aci_l2cap_coc_connect_event_rp0 *p_coc_connect;
          tBleStatus ret;
          uint16_t Result = 0x0001;
          uint8_t Channel_Number;
          uint8_t Channel_Index_List[5u];
          p_coc_connect = (aci_l2cap_coc_connect_event_rp0*)p_blecore_evt->data;
          uint8_t Max_Channel_Number = p_coc_connect->Channel_Number;
          LOG_INFO_APP(">>== ACI_L2CAP_COC_CONNECT_VSEVT_CODE\n");
          LOG_INFO_APP(">>==  Credit Based Connection Request :\n");
          LOG_INFO_APP("         Connection_Handle : 0x%04X\n", p_coc_connect->Connection_Handle);
          LOG_INFO_APP("         SPSM : 0x%04X\n", p_coc_connect->SPSM);
          LOG_INFO_APP("         MTU : %d\n", p_coc_connect->MTU);
          LOG_INFO_APP("         MPS : %d\n", p_coc_connect->MPS);
          LOG_INFO_APP("         Initial_Credits : %d\n", p_coc_connect->Initial_Credits);
          LOG_INFO_APP("         Channel_Number : %d\n", p_coc_connect->Channel_Number);
          if (p_coc_connect->SPSM == 0x0027)
          {
            Result = 0x0000u;
          }
          if (Max_Channel_Number > (CFG_BLE_EATT_BEARER_PER_LINK - MAX_NUM_CLIENT_EATT_BEARERS))
          {
            Max_Channel_Number = (CFG_BLE_EATT_BEARER_PER_LINK - MAX_NUM_CLIENT_EATT_BEARERS);
          }
          if (Max_Channel_Number == 0)
          {
            Result = 0x00004u; /*Some connections refused - insufficient resources available*/
          }
          ret = aci_l2cap_coc_connect_confirm(p_coc_connect->Connection_Handle,
                                              CFG_BLE_EATT_MTU_MAX,
                                              CFG_BLE_COC_MPS_MAX,
                                              INITIAL_RX_CREDITS,
                                              Result,
                                              Max_Channel_Number,
                                              &Channel_Number,
                                              Channel_Index_List);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> aci_l2cap_coc_connect_confirm() : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> aci_l2cap_coc_connect_confirm() : Success\n");
            if (Result == 0x000u)
            {
              LOG_INFO_APP("         Number of created channels issued from remote request : %d\n", p_coc_connect->Channel_Number);
              for (uint8_t i = 0u; i < Channel_Number ; i++)
              {
                LOG_INFO_APP("            Channel_Index : 0x%04X\n", Channel_Index_List[i]);
              }
            }
          }
          break;
        }

        case ACI_L2CAP_COC_CONNECT_CONFIRM_VSEVT_CODE:
        {
          aci_l2cap_coc_connect_confirm_event_rp0 *coc_connect_confirm_event;
          tBleStatus status;
          coc_connect_confirm_event = (aci_l2cap_coc_connect_confirm_event_rp0*)p_blecore_evt->data;

          LOG_INFO_APP(">>== ACI_L2CAP_COC_CONNECT_CONFIRM_VSEVT_CODE\n");
          LOG_INFO_APP(">>==  Credit Based Connection Response :\n");
          LOG_INFO_APP("         Connection_Handle : 0x%04X\n", coc_connect_confirm_event->Connection_Handle);
          LOG_INFO_APP("         Result : 0x%04X\n", coc_connect_confirm_event->Result);
          LOG_INFO_APP("         MTU : %d\n", coc_connect_confirm_event->MTU);
          LOG_INFO_APP("         MPS : %d\n", coc_connect_confirm_event->MPS);
          LOG_INFO_APP("         Initial_Credits : %d\n", coc_connect_confirm_event->Initial_Credits);
          LOG_INFO_APP("         Number of created channels issued from local request : %d\n", coc_connect_confirm_event->Channel_Number);
          for (uint8_t i = 0u; i < coc_connect_confirm_event->Channel_Number ; i++)
          {
            LOG_INFO_APP(">>== Channel_Index : 0x%04X\n", coc_connect_confirm_event->Channel_Index_List[i]);
          }
          if (coc_connect_confirm_event->Result == 0x0000u)
          {
            LOG_INFO_APP("==>> Connection Oriented Channel established with success\n");
          }
          else
          {
            LOG_INFO_APP("==>> Connection Oriented Channel failed for reason 0x%02X\n");
          }

          status = aci_gap_send_pairing_req(coc_connect_confirm_event->Connection_Handle, 0x00);
          if (status != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("==>> aci_gap_send_pairing_req : Fail, reason: 0x%02X\n", status);
          }
          else
          {
            LOG_INFO_APP("==>> aci_gap_send_pairing_req : Success\n");
          }
          UNUSED(status);
          break;
        }

