STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_TMAP_Central/STM32_WPAN/App/app_ble.c
        case ACI_L2CAP_COC_DISCONNECT_VSEVT_CODE:
        {
#if (CFG_LOG_SUPPORTED != 0)
          aci_l2cap_coc_disconnect_event_rp0 *coc_disconnect_event;
          coc_disconnect_event = (aci_l2cap_coc_disconnect_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_L2CAP_COC_DISCONNECT_VSEVT_CODE\n");
          LOG_INFO_APP(">>==  Credit Based Connection Disconnected :\n");
          LOG_INFO_APP("         COC ConnHandle = 0x%04X\n",(GATT_EAB_PREFIX << 8) | coc_disconnect_event->Channel_Index);
          LOG_INFO_APP("         Channel_Index = 0x%04X\n",coc_disconnect_event->Channel_Index );
          break;
#endif /*(CFG_LOG_SUPPORTED != 0)*/
        }

        case ACI_L2CAP_COMMAND_REJECT_VSEVT_CODE:
        {
#if (CFG_LOG_SUPPORTED != 0)
          aci_l2cap_command_reject_event_rp0 *aci_l2cap_command_reject_event;
          aci_l2cap_command_reject_event = (aci_l2cap_command_reject_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_L2CAP_COMMAND_REJECT_VSEVT_CODE\n");
          LOG_INFO_APP("         Reason = 0x%04X\n",aci_l2cap_command_reject_event->Reason);
          LOG_INFO_APP("         Connection Handle = 0x%04X\n",aci_l2cap_command_reject_event->Connection_Handle);
          LOG_INFO_APP("         Identifier = %d\n",aci_l2cap_command_reject_event->Identifier);
          break;
#endif /*(CFG_LOG_SUPPORTED != 0)*/
        }

        case ACI_GATT_EATT_BEARER_VSEVT_CODE:
        {
          aci_gatt_eatt_bearer_event_rp0 *eatt_bearer_event;
          eatt_bearer_event = (aci_gatt_eatt_bearer_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_GATT_EATT_BEARER_VSEVT_CODE\n");
          LOG_INFO_APP("EATT Bearer associated to :\n");
          LOG_INFO_APP("        Channel_Handle = 0x%04X\n",eatt_bearer_event->Connection_Handle );
          LOG_INFO_APP("        Channel_Index = 0x%02X\n",eatt_bearer_event->Channel_Index );
          LOG_INFO_APP("        State = 0x%02X\n",eatt_bearer_event->EAB_State );
          LOG_INFO_APP("        MTU = %d\n",eatt_bearer_event->MTU );
          LOG_INFO_APP("        COC ConnHandle = 0x%04X\n",(GATT_EAB_PREFIX << 8) | eatt_bearer_event->Channel_Index);
          if (eatt_bearer_event->EAB_State == 0u)
          {
            uint8_t aChannel_Index[1];
            aChannel_Index[0] = eatt_bearer_event->Channel_Index;
            tBleStatus status = BLE_AUDIO_STACK_EATT_SubscribeBearers(aChannel_Index,1);
            LOG_INFO_APP("BLE_AUDIO_STACK_EATT_SubscribeBearers() for ChannelIdx 0x%02X returns status 0x%02X\n",
                         eatt_bearer_event->Channel_Index,
                         status);
          }
          break;
        }
#endif /*((CFG_BLE_OPTIONS & BLE_OPTIONS_ENHANCED_ATT) == BLE_OPTIONS_ENHANCED_ATT)*/

        /* USER CODE END ECODE_1 */
        default:
        {
          /* USER CODE BEGIN ECODE_DEFAULT */

          /* USER CODE END ECODE_DEFAULT */
          break;
        }
      }
      /* USER CODE BEGIN EVT_VENDOR_1 */

      /* USER CODE END EVT_VENDOR_1 */
    }
    break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */
    /* USER CODE BEGIN EVENT_PCKT */

    /* USER CODE END EVENT_PCKT */
    default:
    {
      /* USER CODE BEGIN EVENT_PCKT_DEFAULT */

      /* USER CODE END EVENT_PCKT_DEFAULT */
      break;
    }
  }
  /* USER CODE BEGIN SVCCTL_App_Notification_1 */

  /* USER CODE END SVCCTL_App_Notification_1 */

  return (SVCCTL_UserEvtFlowEnable);
}

const uint8_t* BleGetBdAddress(void)
{
  const uint8_t *p_bd_addr;

  p_bd_addr = (const uint8_t *)a_BdAddr;

  return p_bd_addr;
}

tBleStatus SetGapAppearance(uint16_t appearance)
{
  tBleStatus ret;

  ret = aci_gatt_update_char_value(bleAppContext.gapServiceHandle,
                                   bleAppContext.gapAppearanceCharHandle,
                                   0,
                                   2,
                                   (uint8_t *)&appearance);
  LOG_INFO_APP("Set apperance 0x%04X in GAP database with status %d\n", appearance, ret);

  return ret;
}

tBleStatus SetGapDeviceName(uint8_t *devicename, uint8_t devicename_len)
{
  tBleStatus ret;

  ret = aci_gatt_update_char_value(bleAppContext.gapServiceHandle,
                                   bleAppContext.gapDevNameCharHandle,
                                   0,
                                   devicename_len,
                                   devicename);
  LOG_INFO_APP("Set device name in GAP database with status %d\n", ret);

  return ret;
}

void APP_BLE_HostNvmStore(void)
{
  /* Start SNVMA write procedure */
  SNVMA_Write(APP_BLE_NvmBuffer, BLE_NvmCallback);
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static uint8_t HOST_BLE_Init(void)
{
  tBleStatus return_status;

  pInitParams.numAttrRecord           = CFG_BLE_NUM_GATT_ATTRIBUTES;
  pInitParams.numAttrServ             = CFG_BLE_NUM_GATT_SERVICES;
  pInitParams.attrValueArrSize        = CFG_BLE_ATT_VALUE_ARRAY_SIZE;
  pInitParams.prWriteListSize         = CFG_BLE_ATTR_PREPARE_WRITE_VALUE_SIZE;
  pInitParams.attMtu                  = CFG_BLE_ATT_MTU_MAX;
  pInitParams.max_coc_nbr             = CFG_BLE_COC_NBR_MAX;
  pInitParams.max_coc_mps             = CFG_BLE_COC_MPS_MAX;
  pInitParams.max_coc_initiator_nbr   = CFG_BLE_COC_INITIATOR_NBR_MAX;
  pInitParams.max_add_eatt_bearers    = CFG_BLE_EATT_BEARER_PER_LINK * CFG_BLE_NUM_LINK;
  pInitParams.numOfLinks              = CFG_BLE_NUM_LINK;
  pInitParams.mblockCount             = CFG_BLE_MBLOCK_COUNT;
  pInitParams.bleStartRamAddress      = (uint8_t*)host_buffer;
  pInitParams.total_buffer_size       = BLE_DYN_ALLOC_SIZE;
  pInitParams.bleStartRamAddress_GATT = (uint8_t*)gatt_buffer;
  pInitParams.total_buffer_size_GATT  = BLE_GATT_BUF_SIZE;
  pInitParams.nvm_cache_buffer        = host_nvm_buffer;
  pInitParams.nvm_cache_max_size      = CFG_BLE_NVM_SIZE_MAX;
  pInitParams.nvm_cache_size          = CFG_BLE_NVM_SIZE_MAX - 1;
  pInitParams.options                 = CFG_BLE_OPTIONS;
  pInitParams.debug                   = 0U;
/* USER CODE BEGIN HOST_BLE_Init_Params */

/* USER CODE END HOST_BLE_Init_Params */
  return_status = BleStack_Init(&pInitParams);
/* USER CODE BEGIN HOST_BLE_Init */

/* USER CODE END HOST_BLE_Init */
  return ((uint8_t)return_status);
}

static void Ble_Hci_Gap_Gatt_Init(void)
{
  uint8_t role;
  uint16_t gap_service_handle = 0U, gap_dev_name_char_handle = 0U, gap_appearance_char_handle = 0U;
  const uint8_t *p_bd_addr;
  uint16_t a_appearance[1] = {CFG_GAP_APPEARANCE};
  const uint8_t *p_ir_value;
  const uint8_t *p_er_value;
  tBleStatus ret;

  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init */
  uint8_t a_hci_commandParams[8] = {0xFFu,0xFFu,0x86u,0xBFu,0x03u,0x00u,0x00u,0x00u};
  /* Mask the HAL Events*/
  aci_hal_set_event_mask(0x00000000);

  /**
   * Set LE Event Mask
   */
  hci_le_set_event_mask(&a_hci_commandParams[0]);
  /* USER CODE END Ble_Hci_Gap_Gatt_Init */

  LOG_INFO_APP("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

